# -*- org-export-babel-evaluate: nil -*-
#+title: Data in Swift 3 parsing a Doom WAD File
#+tags: swift cocoa ios
#+keywords: swift doom wad lumps data nsdata swift3 binary bytes
#+summary: Swift 3 replaces NSData with the Data value type. Implement a Doom Wad file parser with the new Data type to understand the differences.
#+description: Swift 3 replaces NSData with the Data value type. Implement a Doom Wad file parser with the new Data type to understand the differences.
#+OPTIONS: toc:nil

* Basic Differences

One of the most common usage scenarios for =NSData= is the loading and writing of data via these calls:

#+BEGIN_SRC swift
func writeToURL(_ url: NSURL, atomically atomically: Bool) -> Bool
func writeToURL(_ url: NSURL, options writeOptionsMask: NSDataWritingOptions) throws
// ... (implementations for file: String instead of NSURL)
init?(contentsOfURL url: NSURL)
init(contentsOfURL url: NSURL, options readOptionsMask: NSDataReadingOptions) throws
// ... (implementations for file: String instead of NSURL)
#+END_SRC

For those basic usages, very little changed. The new =Data= type offers these methods:

#+BEGIN_SRC swift
init(contentsOf: URL, options: ReadingOptions)
func write(to: URL, options: WritingOptions)
#+END_SRC

Note that =Data= simplifies the various ways of reading and writing data from the file system into two calls while =NSData= offers multiple different methods.

Another difference can be observed when comparing the methods on =NSData= with those on =Data=. While =NSData= offers 30 methods & properties, =Data= offers 130. This huge difference is easily explained via Swift's formidable Protocol Extensions. =Data= obtains many of those methods from the following protocols:

- CustomStringConvertible
- Equatable
- Hashable
- MutableCollection
- RandomAccessCollection
- RangeReplaceableCollection
- ReferenceConvertible

This adds functionality to =Data= which did not exist in =NSData=. Here's a small sample:

#+BEGIN_SRC swift
func distance(from: Int, to: Int)
func dropFirst(Int)
func dropLast(Int)
func filter((UInt8) -> Bool)
func flatMap<ElementOfResult>((UInt8) -> ElementOfResult?)
func forEach((UInt8) -> Void)
func index(Int, offsetBy: Int, limitedBy: Int)
func map<T>((UInt8) -> T)
func max()
func min()
func partition()
func prefix(Int)
func reversed()
func sort()
func sorted()
func split(separator: UInt8, maxSplits: Int, omittingEmptySubsequences: Bool)
func reduce<Result>(Result, (partialResult: Result, UInt8) -> Result)
#+END_SRC

As you can see, many functional approaches, such as mapping or filtering can now be done on the byte contents of =Data= types. This, to me, is a huge improvement over =NSData=. An example of the benefits this brings is how easily you can now subscript and compare data:

#+BEGIN_SRC swift :prologue "import Foundation"
var data = Data(bytes: [0x00, 0x01, 0x02, 0x03])  
print(data[2]) // 2
data[2] = 0x09
print (data == Data(bytes: [0x00, 0x01, 0x09, 0x03])) // true  
#+END_SRC

#+RESULTS:
: 2
: true

=Data= also offers several new initializers which specifically handle other common Swift data types:

#+BEGIN_SRC swift
init(bytes: Array<UInt8>)
init<SourceType>(buffer: UnsafeMutableBufferPointer<SourceType>)
init(repeating: UInt8, count: Int)
#+END_SRC

* Data alternatives to =getBytes=

However, if you're using =Data= this functionality is not available anymore. Instead, =Data= offers a new method:

#+BEGIN_SRC swift
// Access the bytes in the data.
func withUnsafeBytes<ResultType, ContentType>((UnsafePointer<ContentType>) -> ResultType)
#+END_SRC

This method allows direct access of the our data's bytes from within a closure. Let's see a simple example:

#+BEGIN_SRC swift :prologue "import Foundation"
let data = Data(bytes: [0x01, 0x02, 0x03])
data.withUnsafeBytes { (pointer: UnsafePointer<UInt8>) -> Void in
    print(pointer)
    print(pointer.pointee)
}
// Prints: 
// : 0x00007f8dcb77cc50
// : 1
#+END_SRC

Ok, now that we have an unsafe UInt8 pointer into our data, how does this help us? First of fall, we obviously need a different data type, and we're sure (we have to be!) that the data is indeed of this particular data type. We know that this data contains a Int32 type, so how do we decode it correctly?

As we already have a unsafe pointer (of type UInt8) it is easy to move this into an unsafe pointer of our target type. =UnsafePointer= has a =pointee= property which returns the type that the pointer is pointing to as the correct type:

#+BEGIN_SRC swift :prologue "import Foundation"
let data = Data(bytes: [0x00, 0x01, 0x00, 0x00])
let result = data.withUnsafeBytes { (pointer: UnsafePointer<Int32>) -> Int32 in
      return pointer.pointee
}
print(result)
//: 256
#+END_SRC

#+RESULTS:
: 256

As you can see, we created a byte =Data= instance, and returned the data as =Int32= by defining an =UnsafePointer<Int32>= in the closure. You can shorten this code if the compiler is able to infer the result type from the context:

#+BEGIN_SRC swift
let result: Int32 = data.withUnsafeBytes { $0.pointee }
#+END_SRC

* Generic Solution

Now that we have a way of accessing raw bytes and casting them to the correct type, we ought to create a generic solution that allows us to perform this operation easily without the syntactical overhead. Also, we still did not account for the fact that we need to perform the operation on a subsequence of our data and not the whole =Data= instance. A generic solution would look like this:

#+BEGIN_SRC swift :prologue "import Foundation"
extension Data {
    func scanValue<T>(start: Int, length: Int) -> T {
        return self.subdata(in: start..<start+length).withUnsafeBytes { $0.pointee }
    }
}
let data = Data(bytes: [0x01, 0x02, 0x01, 0x02])
let a: Int16 = data.scanValue(start: 0, length: 1)
print(a)
// : 1
#+END_SRC

#+RESULTS:
: 2
Compared to our earlier code, this has a couple of notable differences:
- We're using =subdata= to only scan the bytes of a specific slice of our Data. 
- We're using generics to support different possible data types for extraction

* To Data

The opposite case, taking an existing variable and getting a =Data= buffer to the content, is not relevant for the Doom example below, but easy enough to implement:

#+BEGIN_SRC swift :prologue "import Foundation"
var variable = 256
let data = Data(buffer: UnsafeBufferPointer(start: &variable, count: 1))
print(data) // : <00010000 00000000>
#+END_SRC

#+RESULTS:
: <00010000 00000000 00000000 00000000>

